[
    {
      "_id": "RS101",
      "name": "Rocket Propulsion",
      "number": "RS4550",
      "startDate": "2023-01-10",
      "endDate": "2023-05-15",
      "department": "D123",
      "credits": 4,
       "image": "/images/pic1.webp",
      "description": "This course provides a comprehensive understanding of the principles and mechanics behind rocket engines, crucial for space exploration and high-speed flight. Students will delve into the study of thermodynamics, fluid dynamics, and combustion processes to understand how propulsion systems generate thrust. The course explores various types of propulsion systems, including liquid, solid, and hybrid rockets, emphasizing their design, optimization, and performance metrics such as specific impulse and efficiency. Key components like nozzles, combustion chambers, and turbopumps are analyzed in detail, along with mission-critical aspects such as multi-stage design and staging techniques. Additionally, the course covers safety protocols and experimental methods for testing rocket engines, preparing students for challenges in aerospace engineering and space missions."
    },
    {
      "_id": "RS102",
      "name": "Aerodynamics",
      "number": "RS4560",
      "startDate": "2023-01-10",
      "endDate": "2023-05-15",
      "department": "D123",
      "credits": 3,
       "image": "/images/pic2.webp",
      "description": "This course focuses on the study of how air interacts with solid objects, especially in the context of aircraft, automobiles, and other vehicles. The course typically introduces students to the fundamental principles governing the behavior of airflows and how they impact the performance, stability, and control of vehicles."
    },
    {
      "_id": "RS103",
      "name": "Spacecraft Design",
      "number": "RS4570",
      "startDate": "2023-01-10",
      "endDate": "2023-05-15",
      "department": "D123",
      "credits": 4,
       "image": "/images/pic3.webp",
      "description": "This course focuses on the engineering principles and methodologies involved in designing spacecraft for various missions, including satellite deployment, interplanetary exploration, and human spaceflight. The course typically covers both theoretical and practical aspects of spacecraft systems, guiding students through the entire design process from concept to launch."
    },
  
    {
      "_id": "CS 4180",
      "name": "Reinforcement Learning",
      "number": "CS 4180",
      "startDate": "2023-01-10",
      "endDate": "2023-05-15",
      "department": "Ministry",
      "credits": 3,
      "image": "/images/pic4.webp",
      "description": "Introduces reinforcement learning and the Markov decision process (MDP) framework. Covers methods for planning and learning in MDPs such as dynamic programming, model-based methods, and model-free methods. Examines commonly used representations including deep-learning representations. Students are expected to have a working knowledge of probability, to complete programming assignments, and to complete a course project that applies some form of reinforcement learning to a problem of interest.",
      "author": "65500111ea7ead465908d1fa"
    },
    {
      "_id": "CS 4300",
      "name": "Computer Graphics",
      "number": "CS 4300",
      "startDate": "2023-01-10",
      "endDate": "2023-05-15",
      "department": "Islamic Studies",
      "credits": 3,
      "image": "/images/pic5.webp",
      "description": "Charts a path through every major aspect of computer graphics with varying degrees of emphasis. Discusses hardware issues: size and speed; lines, polygons, and regions; modeling, or objects and their relations; viewing, or what can be seen (visibility and perspective); rendering, or how it looks (properties of surfaces, light, and color); transformations, or moving, placing, distorting, and animating and interaction, or drawing, selecting, and transforming.",
      "author": "655000a4ea7ead465908d1f5"
    },
    {
      "_id": "CS 4360",
      "name": "Non-Interactive Computer Graphics",
      "number": "CS 4360",
      "startDate": "2023-01-10",
      "endDate": "2023-05-15",
      "department": "Islamic Ethics",
      "credits": 3,
      "image": "/images/pic6.webp",
      "description": "Introduces computer graphics algorithms and concepts primarily focusing on offline rendering techniques. Consists of a lecture component and in-class laboratory to study common image synthesis algorithms and techniques to generate images used in games and 3D animated movies. Culminates with a final project in which students complete in groups or individually a renderer for generating high quality images. Students with an interest in a career as a graphics, rendering, or high performance computer engineer may consider taking this course.",
      "author": "655000a4ea7ead465908d1f5"
    }
  ]